#+startup: overview
#+title: Linux_Shell脚本攻略
#+author: dream

*** 4.3.3 补充内容
    1. 递归搜索文件
       #+begin_src bash
	 grep "text" . -R -n
       #+end_src

    2. 忽略样式中的大小写
       选项-i可以使匹配样式不考虑字符的大小写,例如:
       #+begin_src bash
	 echo hello world | grep -i "HELLO"
       #+end_src

    3. 用grep匹配多个样式
       在进行匹配的时候通常只指定一个样式.然而,我们
       可以用选项-e来指定多个匹配样式:
       #+begin_src bash
	 grep -e "pattern1" -e "pattern"
       #+end_src

       例如:
       #+begin_src bash
	 echo this is a line of text | grep -e "this"\
	  -e "line" -o
       #+end_src

       还有另一种方法也可以指定多个样式.我们可以提供一个
       样式文件用于读取样式.在样式文件中逐行写下需要匹配
       样式,然后用选项-f选项执行grep:
       #+begin_src bash
	 grep -f pattern_file source_filename
       #+end_src

       #+begin_src bash
	 echo hello this is cool | grep -f pat_file
       #+end_src

    4. 在grep搜索中包括或排除文件
       在目录中递归搜索所有的.c和.cpp文件
       #+begin_src bash
	 grep "main()" . -r --include *.{c,cpp}
       #+end_src

       在搜索中排除所有的README文件:
       #+begin_src bash
	 grep "main()" . -r --exclude "README"
       #+end_src

       如果需要排除目录,可以使用--exclude-dir选项.
       如果需要从文件中读取所需排除的文件列表,使用
       --exclude-from FILE.

    5. 使用0值字节后缀的grep与xargs
       grep 输出以0值字节作为终结符的文件名(\0).这可以用grep的
       -Z选项来指定.
       #+begin_src bash
	 grep "test" file* -lZ | xargs -0 rm
       #+end_src

    6. grep的静默输出

    7. 打印出匹配文本之前或之后的行

       打印匹配某个结果之后的三行,使用-A选项:
       #+begin_src bash
	 seq 10 | grep 5 -A 3
       #+end_src

       打印匹配某个结果之前的三行,使用-B选项:
       #+begin_src bash
	 seq 10 | grep 5 -B 3
       #+end_src

       打印匹配某个结果之前及之后的3行,使用-C选项:
       #+begin_src bash
	 seq 10 | grep 5 -C 3
       #+end_src

       如果有多个匹配,那么以一行"--"作为各匹配之间的定界符:
       #+begin_src bash
	 echo -e "a\nb\nc\na\nb\nc" | grep a -A 1
       #+end_src

       #+RESULTS:
       | a  |
       | b  |
       | -- |
       | a  |
       | b  |

*** 4.8.3 补充内容
我们已经看过了用sed进行文本替换的基本用法.接下来看一看如何将替换
过的文本保存到原文件中.

将替换结果保存到文件中

当文件名传递给sed时,sed会将输出写入stdout.如果不想将输出传送
至stdout,而是将更改保存到文件中,那么可以使用-i选项:
#+begin_src bash
  sed 's/PATTERN/replacement/' -i filename
#+end_src

例如,用另一个指定的数字替换文件中所有的3位数字:
#+begin_src bash
  cat sed_data.txt | sed 's/\b[0-9]\{3\}\b/NUMBER/g'
#+end_src

#+RESULTS:
: abc 111 this 9 file contains 111 11 88 numbers 0000

下面代码中\b匹配不到字符.
#+begin_src bash
  cat sed_data.txt | sed 's/\b[0-9]\{3\}\b/NUMBER/g'
#+end_src

上面的单行命令只替换3位数字.\b[0-9]\{3\}\b是一个用于匹配3位数
字的正则表达式.[0-9]表示从0到9的数字范围.{3}用来匹配3次之前的数字.
\{3\}中的\用于赋予{和}特殊的含义.\b是单词边界标记.

*** 4.9.2 工作原理
首先梳理一下对JavaScript进行压缩与解压缩的处理逻辑以及代码
#+begin_src bash
  cat sample.js
#+end_src

#+RESULTS:
| functionsign_out(){             |                     |
| $("#loading").show();           |                     |
| $.get("log_in",{logout:"True"}, |                     |
|                                 | function(){         |
|                                 | window.location=""; |
|                                 | });                 |
| }                               |                     |

下面列出了为压缩Javascript所需完成的工作.
1. 移除换行符和制表符.
2. 压缩空格
3. 替换注释/*内容*/.
4. 替换下列内容:
   - "{ "替换为"{"
   - " }"替换为"}"
   - " ("替换为"("
   - ") "替换为")"
   - ", "替换为","
   - " ; "替换为";"(我们需要移除所有多余的空格)

要解压缩或者恢复JavaScript的可读性,我们需要执行下面的任务:
1. 用";\n"替换";".
2. 用"{\n"替换"{","\n}"替换"}".

*** 工作原理
可以用paste命令实现按列拼接,其语法如下:
  paste file1 file2 file3

让我们来尝试一下:
#+begin_src bash
  cat paste1.txt
#+end_src

#+begin_src bash
  cat paste2.txt
#+end_src

#+begin_src bash
  paste paste1.txt paste2.txt
#+end_src

#+RESULTS:
| 1 | slynux |
| 2 | gnu    |
| 3 | bash   |
| 4 | hack   |
| 5 |        |

默认的定界符是制表符,也可以用-d明确指定定界符,例如:
#+begin_src bash
  paste -d ":" paste1.txt paste2.txt
#+end_src


